GREETING_TEXT = """
Небольшая инструкция: 
    * ЧТобы выбрать конкретного юнита или способность, введите число, соотвествующее выбору.
    * При создании команды, вводите имена доступных юнитов. Не обязательно вводить их с большой буквы, программа прекрасно поймет вас и так.
    * В любой момент вы можете выйти из игры, нажав комбинацию клавиш CTRL-C, но обратите внимание, что весь прогресс будет удален! При перезапуске программы вы начнете сначала.
    * Программа находится в стадии разработки, поэтому по возможности не обращайте внимание на кривой интерфейс, он еще приводится в порядок.
"""



UNDEAD_DESC = """
    К данной фракции принадлежат различные мертвецы и злые духи. У них меньше здоровья, чем у других двух фракций, но выше инициатива и урон.
    Если вы выбрали Нежить, постарайтесь нанести как можно больше урона за короткий срок, все-таки мертвецы долго не протянут.

    В данной фракции есть следующие мобы:
        * Анчутка - обычный черт, мелкий и хилый, но очень быстрый. Неплохой для быстрой атаки, но следите за его здоровьем.
            Активные способности:
                * Двойной урад - наносит выбранному противнику удар два раза.

        * Упырь - кровосос, достаточно быстрый и сильный, может представлять серьезную опасности для противников.
            Активные способности:
                * Жажда крови - наносит урон выбранному противнику и восстанавливает себе здоровье на такое же количество очков.

        * Мара = злобный дух, повелительница кошмаров. Не слишком сильная, но ее козырь не в грубой силе.
            Активные способности:
                * Кошмар - накладывает обездвиживание на выбранного противника, тот теряет способность действовать на несколько ходов.
                * Ужас ночи - накладывает обездвиживание на всю группу противников, те теряют способность действовать несколько ходов.

        * Вытьянка - неупокоенная душа, воющая по другим. 
            Активные способности:
                * Вой по живым - восстанавливает здоровье выбранному юниту.
                * 
                * Не время умирать - воскрешает выбранного дружественного юнита, тот получает 35 Очков здоровья.
            
        * Вурдалак - восставший мертвец. Он медленный, но живучий. Без шуток.
            Активные способности:
                * 
"""



BEASTS_DESC = """    
    К данной фракции принадлежат различные лесные твари и чудища. Они медленнее, чем другие две фракции, но у них больше здоровья.
    Если вы выбрали Тварей, постарайтесь контролировать ход боя как можно дольше, тогда ваши бойцы смогут успеть собраться перед нанесением удара.

    В данной фракции есть следующие мобы:
        * Банник
            Активные способности:

        * Волколак
            Активные способности:

        * Берендей
            Активные способности:
            
        * Болотница
            Активные способности:
        * Кикимора    
"""



HUMANS_DESC = """
    К данной фракции принадлежат люди и различные добрые духи. У них средние показатели, и главная их тактика - умеренный бой.
    Если вы выбрали Нежить, постарайтесь сохранять команду в состоянии приподнятого духа как можно дольше, уверенные в себе бойцы наносят больше урона.

    В данной фракции есть следующие мобы:
        * Домовой
            Активные способности:

        * Ведьмак
            Активные способности:

        * Берегиня
            Активные способности:
        
        * Богатырь
            Активные способности:

        * Жрец
            Активные способности:

"""